suspect_list = [
    ['스칼렛(F)', '머스터드(M)', '화이트(F)', '그린(M)', '플럼(M)', '피콕(F)', '헨리(M)'],
    ['단검', '밧줄', '총', '가위', '쇠파이프', '창', '촛대'],
    ['야외 테라스', '주방', '침실', '호수', '서재', '정원', '무도회장', '마구간'],
]

suspectFeature = {
    '남자': ['머스터드(M)', '그린(M)', '플럼(M)', '헨리(M)'],
    '여자': ['스칼렛(F)', '화이트(F)', '피콕(F)'],
    '날카로운 것': ['단검', '가위', '창'],
    '날카롭지 않은 것': ['밧줄', '총', '쇠파이프', '촛대'],
    '실내': ['주방', '침실', '서재', '무도회장'],
    '실외': ['야외 테라스', '호수', '정원', '마구간'],
}

suspectAll = [
    '스칼렛(F)', '머스터드(M)', '화이트(F)', '그린(M)', '플럼(M)', '피콕(F)', '헨리(M)',
    '단검', '밧줄', '총', '가위', '쇠파이프', '창', '촛대',
    '야외 테라스', '주방', '침실', '호수', '서재', '정원', '무도회장', '마구간',
]
